In [1]:
people = {
    "Name": ["Arsalan", "Farhan", "Adnan"],
    "Hobby": ["Codeing", "Cycling", "Marketing"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      Name      Hobby
0  Arsalan    Codeing
1   Farhan    Cycling
2    Adnan  Marketing

In [11]:
df["Hobby"]

0      Codeing
1      Cycling
2    Marketing
Name: Hobby, dtype: object

In [16]:
df.Name    #used dot notation but prefer brackets because attributes may have same name as column name

0    Arsalan
1     Farhan
2      Adnan
Name: Name, dtype: object

In [18]:
df[{"Hobby", "Name"}]

      Name      Hobby
0  Arsalan    Codeing
1   Farhan    Cycling
2    Adnan  Marketing

In [19]:
df.columns

Index(['Name', 'Hobby'], dtype='object')

In [24]:
df.iloc[[0, 1], 1]

0    Codeing
1    Cycling
Name: Hobby, dtype: object

In [25]:
df

      Name      Hobby
0  Arsalan    Codeing
1   Farhan    Cycling
2    Adnan  Marketing

In [27]:
df.loc[0]

Name     Arsalan
Hobby    Codeing
Name: 0, dtype: object

In [31]:
df.loc[[0, 1]]

      Name    Hobby
0  Arsalan  Codeing
1   Farhan  Cycling